#include <iostream>
using namespace std;

int function(int num) {
	int temp = 1;
	for (int i = 1; i < num + 1; i++)
		temp *= i;

	return temp;
}

int main() {
	//system("chcp 1251>nul");
	cout << "Функцiя, обчислює факторiал натурального числа\n";
	cout << "Введiть число: ";
	int num;
	cin >> num;
  
	cout << "Факторiал числа " << num << " : ";
	cout << function(num) << endl;
}

/*
Написати функцію для обчислення факторіала.
Операцію очислення факторіала можна зробити частиною попереднього калькулятора.
Факторіалом числа Ч називається добуток послідовності чисел 1 * 2 * 3 * 4*...*Ч.
В математиці факторіал позначається знаком оклику.Наприклад: 5!= 1 * 2 * 3 * 4 * 5.
*/
